app/controllers/application_controller.rb

SELECT  `sections`.* FROM `sections` WHERE `sections`.`name` = 'getPagesNav' LIMIT 1
SELECT COUNT(*) FROM `pages` WHERE `pages`.`section_id` = 2
SELECT `pages`.* FROM `pages` WHERE `pages`.`section_id` = 2
---
	def getPagesNav
		name = params[:t]
		id = Section.find_by_name(name).id
		##
		@pageNave = Page.display_by_section(id)
		if @pageNave.any?